In [2]:
import pandas
import numpy as np
df = pandas.DataFrame({
   'col1': ['Item0', 'Item0', 'Item1', 'Item1'],
   'col2': ['5465465', 'Bronze1', 'Gold', 'Silver'],
   'col3': [1, 2, 0, 4]
})

In [9]:
import pandas as pd
import numpy as np
dates = pd.date_range('20130101',periods=6)
s = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=(['yeee','ssss','ssdd','ssd22']))
s

                yeee      ssss      ssdd     ssd22
2013-01-01 -1.879562  0.143839 -0.244404  0.676232
2013-01-02 -1.538639  0.748922  2.345561 -0.319549
2013-01-03  0.140546 -0.158264  0.276166  0.857692
2013-01-04  0.631712 -0.748358  1.064075  0.107713
2013-01-05 -1.653485  0.807772  0.162849  0.958474
2013-01-06 -0.746855  0.163865  0.407324  0.386909

In [7]:
df.head()

    col1     col2  col3
0  Item0  5465465     1
1  Item0  Bronze1     2
2  Item1     Gold     0
3  Item1   Silver     4

In [8]:
df.tail(1)

    col1    col2  col3
3  Item1  Silver   4.0

In [9]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [10]:
df.values

array([['Item0', 'Gold', 1.0],
       ['Item0', 'Bronze', 2.0],
       ['Item1', 'Gold', nan],
       ['Item1', 'Silver', 4.0]], dtype=object)

In [11]:
df.describe()

           col3
count  3.000000
mean   2.333333
std    1.527525
min    1.000000
25%    1.500000
50%    2.000000
75%    3.000000
max    4.000000

In [16]:
df.sort_index(axis=0, ascending=True)

    col1    col2  col3
0  Item0    Gold   1.0
1  Item0  Bronze   2.0
2  Item1    Gold   NaN
3  Item1  Silver   4.0

In [19]:
df.sort_values(by=['col2', 'col1'], ascending=False)

    col1     col2  col3
3  Item1   Silver   4.0
2  Item1     Gold   NaN
0  Item0     Gold   1.0
1  Item0  Bronze1   2.0

In [ ]:
df.iloc[3]

In [ ]:
df['col3']

In [ ]:
df[df.col3 > 0]

In [ ]:
df[df['col2'].isin(['Gold', 'Silver'])]

## Modify

In [ ]:
df.at[1, 'col2'] = 'Bronze and Gold' 
df

In [ ]:
df.iat[1,1] = 'Bronze again' 
df

In [ ]:
# Replaces the column with the array. It could be a numpy array or a simple list.
#Could also be used to create new columns
df.loc[:,'col3'] = ['Unknown'] * len(df) 
df

In [3]:
df = pandas.DataFrame({
   'col1': ['Item0', 'Item0', 'Item1', 'Item1'],
   'col2': ['Gold', 'Bronze', 'Gold', 'Silver'],
   'col3': [1, 2, np.nan, 4]
})

In [4]:
df.dropna(how='any')
df

    col1    col2  col3
0  Item0    Gold   1.0
1  Item0  Bronze   2.0
2  Item1    Gold   NaN
3  Item1  Silver   4.0

In [6]:
def f(x):
    return x + ' New Column'

In [5]:
# Uses the unary function f to create a new column based on an existing one
df.col4 = ['rrr']
df

    col1    col2  col3
0  Item0    Gold   1.0
1  Item0  Bronze   2.0
2  Item1    Gold   NaN
3  Item1  Silver   4.0